---
kind: type
id: T:Autodesk.Revit.DB.IFC.IIFCImporterServer
source: html/9fff7078-273b-363b-04f5-b4adcd4a5590.htm
---
# Autodesk.Revit.DB.IFC.IIFCImporterServer

Interface for external servers implementing IFC import.

## Syntax (C#)
```csharp
public interface IIFCImporterServer : IExternalServer
```